import { useState, useEffect } from "react";
import styles from "./Jobs.module.css";
import JobSearch from "../../components/job/JobSearch/JobSearch";
import JobFilter from "../../components/job/JobFilter/JobFilter";
import JobList from "../../components/job/JobList/JobList";
import JobCard from "../../components/job/JobCard/JobCard";
import Breadcrumbs from "../../components/ui/Breadcrumbs/Breadcrumbs";
import BackButton from "../../components/ui/BackButton/BackButton";

function Jobs() {
 const [
  selectedCategory,
  setSelectedCategory,
] = useState(() => {
  const saved =
    localStorage.getItem(
      "selectedCategory"
    );

  return saved
    ? JSON.parse(saved)
    : null;
});

const [search, setSearch] =
  useState(() => {
    return (
      localStorage.getItem(
        "search"
      ) || ""
    );
  });

  const [showFilter, setShowFilter] =
  useState(false);

const [filters, setFilters] =
  useState(() => {
    const saved =
      localStorage.getItem(
        "filters"
      );

    return saved
      ? JSON.parse(saved)
      : {
          salaryFrom: "",
          salaryTo: "",
          experience:
            "Любой",
          schedule:
            "Любой",
          city:
            "Все города",
        };
  });

  useEffect(() => {
  localStorage.setItem(
    "selectedCategory",
    JSON.stringify(
      selectedCategory
    )
  );
}, [selectedCategory]);

useEffect(() => {
  localStorage.setItem(
    "search",
    search
  );
}, [search]);

useEffect(() => {
  localStorage.setItem(
    "filters",
    JSON.stringify(
      filters
    )
  );
}, [filters]);

  const categories = [
    {
      id: 1,
      title: "Отели, кафе, рестораны",

      jobs: [
        "Шеф-повар",
        "Су-шеф",
        "Повар-универсал",
        "Повар холодного/горячего цеха",
        "Кондитер / Пекарь",
        "Пиццамейкер / Сушист",
        "Бариста / Бармен",
        "Официант",
        "Хостес",
        "Администратор зала",
        "Посудомойщик / Техперсонал",
        "Помощник повара",
        "Менеджер по банкетному обслуживанию"
      ],
    },

    {
      id: 2,
      title: "Продажи, работа с клиентами",

      jobs: [
        "Менеджер по продажам (B2B/B2C)",
        "Продавец-консультант",
        "Кассир",
        "Торговый представитель",
        "Региональный менеджер",
        "Мерчендайзер",
        "Телемаркетолог (продажи по телефону)",
        "Специалист по работе с маркетплейсами",
        "Менеджер по работе с ключевыми клиентами (KAM)",
        "Супервайзер торговой команды",
        "Консультант в интернет-магазин"
      ],
    },

    {
      id: 3,
      title: "Такси, логистика, доставка",

      jobs: [
        "Водитель такси",
        "Водитель-курьер",
        "Пеший курьер / Велокурьер",
        "Водитель международник (Дальнобойщик)",
        "Логист по внутренним перевозкам",
        "Менеджер ВЭД (Китай, Турция, Европа)",
        "Диспетчер службы такси/доставки",
        "Экспедитор",
        "Специалист по таможенному оформлению",
        "Водитель спецтехники",
        "Координатор логистических потоков"
      ],
    },

    {
      id: 4,
      title: "Строительные специальности",

      jobs: [
        "Прораб / Бригадир",
        "Каменщик / Кирпичник",
        "Электрик",
        "Сантехник / Сварщик",
        "Плиточник",
        " Маляр-штукатур",
        "Гипсокартонщик",
        "Арматурщик / Бетонщик",
        "Кровельщик",
        "Инженер-проектировщик",
        "Разнорабочий",
        "Специалист по фасадным работам"
      ],
    },

    {
      id: 5,
      title: "Швейное дело",

      jobs: [
        "Швея (массovка)",
        "Швея (индивидуальный пошив)",
        "Технолог швейного цеха",
        "Конструктор лекал",
        "Закройщик",
        "Утюжильщик",
        "Мастер швейного цеха",
        "Контролер качества (ОТК)",
        "Механик швейного оборудования",
        "Помощник швеи",
        "Дизайнер одежды",
        "Настильщик"
      ],
    },

    {
      id: 6,
      title: "Производство",

      jobs: [
        "Начальник производства",
        "Оператор производственной линии",
        "Инженер-механик",
        "Технолог пищевого производства",
        "Слесарь-сборщик",
        "Токарь / Фрезеровщик",
        "Мастер смены",
        "Контролер ОТК",
        "Кладовщик на производстве",
        "Упаковщик готовой продукции",
        "Технолог мебельного производства"
      ],
    },

    {
      id: 7,
      title: "Домашний персонал и уборка",

      jobs: [
        "Няня (дневная/с проживанием)",
        "Домработница",
        "Сиделка (уход за пожилыми)",
        "Клинер (специалист по уборке)",
        "Повар в семью",
        "Гувернантка",
        "Садовник",
        "Хозяйственный помощник",
        "Водитель в семью",
        "Мойщик окон",
        "Мастер на час (муж на час)"
      ],
    },

    {
      id: 8,
      title: "Склад",

      jobs: [
        "Заведующий складом",
        "Кладовщик",
        "Комплектовщик / Сборщик заказов",
        "Грузчик",
        "Оператор 1С (Склад)",
        "Приемщик товара",
        "Водитель погрузчика (карщик)",
        "Маркировщик / Стикеровщик",
        "Упаковщик",
        "Ревизор / Инспектор склада",
        "Сортировщик"
      ],
    },

    {
      id: 9,
      title: "СТО, автобизнес",

      jobs: [
        "Автомеханик (ходовик)",
        "Автоэлектрик",
        "Моторист",
        "Автомаляр / Костоправ",
        "Мастер по ремонту КПП",
        "Диагност",
        "Шиномонтажник",
        "Автомойщик / Детейлер",
        "Менеджер по продаже автозапчастей",
        "Мастер-приемщик",
        "Специалист по выкупу авто",
        "Тонировщик"
      ],
    },

    {
      id: 10,
      title: "Салоны красоты",

      jobs: [
       "Парикмахер-стилист",
        "Мастер маникюра / педикюра",
        "Лешмейкер (ресницы) / Бровист",
        "Косметолог-эстетист",
        "Визажист",
        "Барбер",
        "Мастер по депиляции (шугаринг)",
        "Массажист",
        "Тату-мастер",
        "Администратор салона",
        "Мастер по наращиванию волос"
      ],
    },

    {
      id: 11,
      title: "Административный персонал",

      jobs: [
         "Офис-менеджер",
         "Ресепшн / Секретарь",
         "HR-менеджер / Рекрутер",
         "Помощник руководителя",
         "Оператор Call-центра",
         "Специалист по кадрам (КДP)",
         "Переводчик",
         "Делопроизводитель",
         "Архивариус",
         "Завхоз",
         "Менеджер по закупкам в офис"
      ],
    },

     {
      id: 12,
      title: "Охрана, безопасность",

      jobs: [
       "Охранник (объектовый)",
         "Личный охранник (телохранитель)",
         "Начальник службы безопасности",
         "Специалист видеонаблюдения",
         "Инкассатор",
         "Инженер по пожарной безопасности",
         "Контролер КПП",
         "Сторож (ночной)",
         "Специалист по установке сигнализаций",
         "Вахтер",
         "ГБР (группа быстрого реагирования)"
      ],
    },

     {
      id: 13,
      title: "Сфера образования",

      jobs: [
       "Учитель начальных классов",
        "Преподаватель иностранных языков",
        "Воспитатель",
        "Репетитор (ОРТ, школьные предметы)",
        "Методист",
        "Преподаватель IT / Дизайна",
        "Тренер / Инструктор по спорту",
        "Психолог (педагог)",
        "Логопед",
        "Инструктор по вождению",
        "Профориентолог"
      ],
    },

     {
      id: 14,
      title: "Медицина, фармацевтика",

      jobs: [
       "Врач (терапевт, стоматолог и др.)",
        "Медицинская сестра / Брат",
        "Фармацевт / Провизор в аптеку",
        "Лаборант",
        "Акушер-гинеколог",
        "Педиатр",
        "Косметолог (с мед. образованием)",
        "Массажист (лечебный)",
        "Фельдшер",
        "Администратор клиники",
        "Санитар"
      ],
    },

     {
      id: 15,
      title: "Сельское хозяйство",

      jobs: [
       "Агроном",
        "Ветеринар",
        "Зоотехник",
        "Тракторист / Комбайнер",
        "Рабочий на ферму / Постух",
        "Специалист по теплицам",
        "Пчеловoд",
        "Ирригатор",
        "Технолог по переработке сельхозпродукции",
        "Механизатор",
        "Садовod"
      ],
    },

     {
      id: 16,
      title: "Сетевой маркетинг",

      jobs: [
       "Консультант по продукции",
        "Менеджер по развитию сети",
        "Дистрибьютор",
        "Лидер группы (Team Leader)",
        "Специалист по прямым продажам",
        "Обучающий тренер по продукту",
        "Координатор структуры",
        "Организатор промо-акций",
        "Консультант по красоте/здоровью",
        "Менеджер по рекрутингу в сеть"
      ],
    },

     {
      id: 17,
      title: "IT, компьютеры, связь",

      jobs: [
       "Frontend разработчик",
        "Backend разработчик",
        "Мобильный разработчик",
        "Тестировщик (QA)",
        "Системный администратор",
        "UX/UI Дизайнер",
        "Project менеджер",
        "Специалист техподдержки",
        "Инженер связи / Монтажник сетей",
        "Data Scientist",
        "DevOps инженер"
      ],
    },

     {
      id: 18,
      title: "Маркетинг, реклама, PR",

      jobs: [
       "SMM-специалист",
        "Таргетолог / Контекстолог",
        "PR-менеджер",
        "Копирайтер",
        "Графический дизайнер",
        "Маркетолог-аналитик",
         "Event-менеджер",
         "Видеомонтажer / Motion дизайнер",
         "SEO-специалист",
         "BTL-менеджer",
         "Креативный директор"
      ],
    },

     {
      id: 19,
      title: "Развлечения, спорт",

      jobs: [
       "Фитнес-тренер",
        "Аниматор",
        "Инструктор по йоге / танцам",
        "Звукооператор / Диджей",
        "Организатор мероприятий",
        "Ведущий (Тамада)",
        "Фотограф / Видеограф",
        "Инструктор в бассейн",
        "Гид в горы / Альпинист",
        "Спортивный администратор",
        "Промоутер"
      ],
    },

     {
      id: 20,
      title: "Недвижимость",

      jobs: [
       "Риелтор (вторичное жилье)",
        "Агент по новостройкам",
        "Специалист по коммерческой недвижимости",
        "Менеджер по аренде",
        "Оценщик недвижимости",
        "Юрист по земельным вопросам",
        "Брокер",
        "Управляющий жилым комплексом",
        "Консультант по ипотеке",
        "Фотограф для объявлений (интерьерный)",
        "Сюрвейер"
      ],
    },

     {
      id: 21,
      title: "Другие специальности",

      jobs: [
       "Юрист / Адвокат",
        "Нотариус",
        "Эколог",
        "Метеоролог",
        "Ювелир",
        "Часовщик",
        "Дизайнер интерьера",
        "Переводчик (синхронист)",
        "Специалист по тендерам",
        "Страховой агент",
        " Социолог"
      ],
    },

     {
      id: 22,
      title: "Работа за границей",

      jobs: [
       "Сезонный рабочий (сбор ягод/овощей)",
        "Рабочий на завод / склад (Европа)",
        "Водитель дальнобойщик (международник)",
        "Строитель (для зарубежных проектов)",
        "Персонал в отели (Турция, ОАЭ)",
        "Медперсонал (Германия)",
        "Няня / Au-Pair",
        "Горничная (Европа/Азия)",
        "Повар (контрактная работа)",
        "Специалист по уходу (Польша, Италия)",
        "Электрик / Монтажник (за рубеж)"
      ],
    },

     {
      id: 23,
      title: "Бухгалтерия и аудит",

      jobs: [
       "Главный бухгалтер",
        "Бухгалтер (участок ЗП)",
        "Бухгалтер (участок ТМЦ)",
        "Финансовый директор",
        "Кассир-бухгалтер",
        "Налоговый консультант",
        "Аудитор",
        "Экономист",
        "Специалист по 1С",
        "Помощник бухгалтера",
        "Аналитик финансовой отчетности"
      ],
    },

     {
      id: 24,
      title: "Юриспруденция",

      jobs: [
       "Юрисконсульт",
        "Адвокат",
        "Нотариус / Помощник нотариуса",
        "Корпоративный юрист",
        "Специалист по защите прав потребителей",
        "Судебный исполнитель",
        "Юрист по кадровым вопросам",
        "Специалист по интеллектуальной собственности",
        "Коллектор / Специалист по взысканию",
        "Медиатор",
        "Юрист-регистратор"
      ],
    },

     {
      id: 25,
      title: "Культура и Искусство",

      jobs: [
       "Музыкант / Певец",
        "Художник / Иллюстратор",
        "Артист театра и кино",
        "Режиссер монтажа",
        "Дизайнер декораций",
        "Искусствовед",
        "Реставратор",
        "Библиотекарь",
        "Куратор выставок",
        "Хореограф",
        "Музейный работник"
      ],
    },

     {
      id: 26,
      title: "Государственная и муниципальная служба",

      jobs: [
       "Ведущий специалист в мэрию",
        "Сотрудник налоговой службы",
        "Инспектор соцзащиты",
        "Делопроизводитель в гос. орган",
        "Специалист архивного отдела",
        "Пресс-секретарь министерства",
        "Инженер в архитектуру/градостроительство",
        "Эколог-инспектор",
        "Специалист по молодежной политике",
        "Статистик",
        "Специалист по работе с обращениями граждан"
      ],
    },
  ];

  return (
    <section className={styles.jobs}>
      <div className={styles.container}>
          <BackButton />
        <Breadcrumbs items={["Главная", "Вакансии"]} />
        <JobSearch
          search={search}
          setSearch={setSearch}
          setShowFilter={setShowFilter}
        />

      <div className={styles.categories}>
  {categories.map((category) => (
    <button
      key={category.id}
      // Добавляем вот эту проверку для класса active:
      className={`${styles.categoryBtn} ${
        selectedCategory?.id === category.id ? styles.active : ""
      }`}
      onClick={() => {
        setSelectedCategory(category);
        localStorage.removeItem("selectedJob");
      }}
    >
      {category.title}
    </button>
  ))}
</div>

        <div className={styles.content}>
  <JobFilter
  filters={filters}
  setFilters={setFilters}
/>

  <JobList
  selectedCategory={
    selectedCategory
  }
  search={search}
  filters={filters}
/>
  
</div>

{showFilter && (
  <div
    className={styles.modalOverlay}
    onClick={() =>
      setShowFilter(false)
    }
  >
    <div
      className={styles.modal}
      onClick={(e) =>
        e.stopPropagation()
      }
    >
      <JobFilter
  filters={filters}
  setFilters={setFilters}
/>
    </div>
  </div>
)}
      </div>
    </section>
  );
}

export default Jobs;